---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Size
source: html/d1f96eab-4446-9b8d-2030-af62a7798ce8.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Size Property

Returns the number of MEPBuildingConstructions that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```